app/controllers/posts_controller.rb

  def create
    @post = Post.create(params[:post].permit!)
---
INSERT INTO `posts` (`title`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('GoodSutdyHardWording', 'GoodSutdyHardWording', 6, '2019-06-05 17:49:21', '2019-06-05 17:49:21')

  def edit
    authorize Post, :update?
    @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1