app/controllers/users_controller.rb

  def create
    @user = User.create(params[:user].permit!)
---
INSERT INTO `users` (`email`, `crypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('1205150638@qq.com', '$2a$10$ooD8LrlH7ebtgj/vDJyQwu.wPlYqmveuK0Yz6mOxbzXm7Bu2nyWNu', 'kgxpvJ-yHnPt7rc42vXG', '2019-06-05 17:11:37', '2019-06-05 17:11:37')